#### :building_construction: Terraform Plan
  <details>

  <summary>dev - 0 to add, 2 to change, 0 to destroy</summary>

  ```
  Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.supernode[0].proxmox_vm_qemu.supernode will be updated in-place
  ~ resource "proxmox_vm_qemu" "supernode" {
      + default_ipv4_address   = (known after apply)
      - hastate                = "disabled" -> null
        id                     = "pm3/qemu/104"
        name                   = "supernode-dev-0"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      ~ sshkeys                = <<-EOT
          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIN9C1hWDBL9driOUQhemBqYUFA1I7VM1UYt5ZDnIynZa
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIENGZph/RX7JwmGIT9bWi+kgUV3XnmVtMma8RuIvv57u
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDtrlD92PUcw1SmnmTIy2/YpfVFlm5b6Crnd0rM6bdzc
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1ZK+lI8Fv3SrEBLXSr/nxMIStBnhi3Iyj8/vQEFQusOo8QpqCj09ivNLnj5GvS7hBnEVOefyvkKKAyDdhpo0dOT9F0WeCj0VMIwuSbflK6IAuk1lp/y2HXc7DT+sFemfJtQ2mNbe+oFU5WOdYCmjUVvJ17DZrdS6iP/TXMPFb9qA8CqeiyIsf1AyceC5h3rR1XuDcrRIZnWEM9w4bjHyNRiPAg6q7DHMZGPOp4WBbN6P+BBN9hNUamVktzD9QIzyiVuSw89mvRYvBRdrUDDoq0+fMgDRdN320MjMqcO/lARRhF2L/F8UfrOslis4j5DmelmQufaHg0ffKQF8sS6Kx
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAsGlElGJxP1/Mr1AhoZsWQn7N8+cZNA3lMd8HPDHRQj
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJHQFe5F5okyt3Oo70cSeZTyUs9c6DFEw3a3jSmtpg+B
        EOT
      - tags                   = " " -> null
      ~ target_nodes           = [
          - "pm3",
          + "pm4",
        ]
      ~ vm_state               = "stopped" -> "running"
        # (47 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.supernode[1].proxmox_vm_qemu.supernode will be updated in-place
  ~ resource "proxmox_vm_qemu" "supernode" {
      ~ bootdisk               = "virtio0" -> "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "pm4/qemu/120"
        name                   = "supernode-dev-1"
      ~ onboot                 = true -> false
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      ~ sshkeys                = <<-EOT
          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIN9C1hWDBL9driOUQhemBqYUFA1I7VM1UYt5ZDnIynZa
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIENGZph/RX7JwmGIT9bWi+kgUV3XnmVtMma8RuIvv57u
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDtrlD92PUcw1SmnmTIy2/YpfVFlm5b6Crnd0rM6bdzc
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1ZK+lI8Fv3SrEBLXSr/nxMIStBnhi3Iyj8/vQEFQusOo8QpqCj09ivNLnj5GvS7hBnEVOefyvkKKAyDdhpo0dOT9F0WeCj0VMIwuSbflK6IAuk1lp/y2HXc7DT+sFemfJtQ2mNbe+oFU5WOdYCmjUVvJ17DZrdS6iP/TXMPFb9qA8CqeiyIsf1AyceC5h3rR1XuDcrRIZnWEM9w4bjHyNRiPAg6q7DHMZGPOp4WBbN6P+BBN9hNUamVktzD9QIzyiVuSw89mvRYvBRdrUDDoq0+fMgDRdN320MjMqcO/lARRhF2L/F8UfrOslis4j5DmelmQufaHg0ffKQF8sS6Kx
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAsGlElGJxP1/Mr1AhoZsWQn7N8+cZNA3lMd8HPDHRQj
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJHQFe5F5okyt3Oo70cSeZTyUs9c6DFEw3a3jSmtpg+B
        EOT
      - tags                   = " " -> null
      ~ vm_state               = "stopped" -> "running"
        # (47 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
  ```

  </details>